//JVENTA22   JOB (),TRALEY,REGION=4M,
//            CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,COND=(0,NE)
//STEP001  EXEC PGM=VENTA22
//STEPLIB  DD  DSN=VERDURA.LIB.LOADLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SALIDA   DD  SYSOUT=*
//ENTRADA  DD  DSN=VERDURA.VENTAS.SEL,DISP=SHR
//FPRODUC  DD  DSN=VERDURA.PRODUC,DISP=SHR
//FVENDED  DD  DSN=VERDURA.VENDEDOR,DISP=SHR
//
